# StructuralConnectionNoSingleRef Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralConnectionFailures..::..StructuralConnectionNoSingleRef Property
BuiltInFailures..::..StructuralConnectionFailures Class See Also
---
Summary: Structural Connection Handler lost connected element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralConnectionNoSingleRef { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionNoSingleRef As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralConnectionNoSingleRef {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace